Merge pull request #13 from Shin-Aska/feature/1.8.5
Feature/1.8.5
